app/views/novels/index.html.erb

SELECT "novels".* FROM "novels"
---
  <tbody>
    <% current_user.novels.each do |novel| %>