app/views/novels/show.html.erb

SELECT "scenes".* FROM "scenes" WHERE "scenes"."novel_id" = ?  [["novel_id", 1]]
---

<% @novel.scenes.sort! { |a,b| a.order <=> b.order }.each do |scene| %>