app/controllers/novels_controller.rb

  def index
    @novels = Novel.all
---
SELECT "novels".* FROM "novels"

  def create
    @novel = Novel.new(novel_params)
    @novel.user_id=session[:user_id]
    respond_to do |format|
      if @novel.save
---
INSERT INTO "novels" ("created_at", "description", "genere", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 13 Apr 2014 02:10:44 UTC +00:00], ["description", "the hunt found."], ["genere", "Fantasy"], ["title", "The Great Find"], ["updated_at", Sun, 13 Apr 2014 02:10:44 UTC +00:00]]

  def destroy
    @novel.destroy
---
DELETE FROM "novels" WHERE "novels"."id" = ?  [["id", 980190962]]

    def set_novel
      @novel = Novel.find(params[:id])
---
SELECT "novels".* FROM "novels" WHERE "novels"."id" = ? LIMIT 1  [["id", "980190962"]]