app/controllers/scenes_controller.rb

  def index
    @scenes = Scene.all
---
SELECT "scenes".* FROM "scenes"

  def create
    puts "the scene paramaters " , scene_params;
    @scene = Scene.new(scene_params)

    respond_to do |format|
      if @scene.save
---
INSERT INTO "scenes" ("content", "created_at", "novel_id", "order", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "I am sure Amy did it."], ["created_at", Tue, 15 Apr 2014 20:50:53 UTC +00:00], ["novel_id", 1], ["order", 3], ["title", "Really"], ["updated_at", Tue, 15 Apr 2014 20:50:53 UTC +00:00]]

  def update
    respond_to do |format|
      if @scene.update(scene_params)
---
UPDATE "scenes" SET "content" = ?, "updated_at" = ? WHERE "scenes"."id" = 8  [["content", "<p>now it was bob.&nbsp;</p>\r\n<p>but how could that be.</p>"], ["updated_at", Thu, 17 Apr 2014 01:14:01 UTC +00:00]]

  def destroy
    @scene.destroy
---
DELETE FROM "scenes" WHERE "scenes"."id" = ?  [["id", 3]]

    def set_scene
      @scene = Scene.find(params[:id])
---
SELECT "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT 1  [["id", "6"]]